[
  {
    "id": 1,
    "name": "Tofunmi Adeyinka",
    "role": "Site Engineer at Calebella Integritas Projects",
    "avatar": "/placeholder.svg",
    "quote": "ERA didn't just teach me engineering — they taught me how to be a professional. The site experience, mentorship, and soft skills training all came together. I was placed within two months of completing the programme.",
    "cohort": "Cohort 3"
  },
  {
    "id": 2,
    "name": "Hamzah Babatunde",
    "role": "Project Coordinator at Black Diamond Engineering",
    "avatar": "/placeholder.svg",
    "quote": "Before ERA, I could solve problems on paper but had never supervised a concrete pour. The hands-on training on active construction sites gave me confidence that no textbook ever could.",
    "cohort": "Cohort 4"
  },
  {
    "id": 3,
    "name": "Wright Okonkwo",
    "role": "Structural Engineer at HFP Engineering",
    "avatar": "/placeholder.svg",
    "quote": "The AutoCAD and structural drawing modules were exceptional. I went from struggling with basic commands to producing full structural detail drawings within four weeks. ERA's instructors are practising engineers — they teach what they do.",
    "cohort": "Cohort 5"
  },
  {
    "id": 4,
    "name": "Adaeze Nwachukwu",
    "role": "Graduate Engineer at Julius Berger Nigeria",
    "avatar": "/placeholder.svg",
    "quote": "What sets ERA apart is their industry connections. The internship placement connected me directly with a firm that matched my career goals. I was offered a full-time role before the programme even ended.",
    "cohort": "Cohort 5"
  },
  {
    "id": 5,
    "name": "Emeka Okafor",
    "role": "Site Supervisor at Craneburg Construction",
    "avatar": "/placeholder.svg",
    "quote": "As a mechanical engineering graduate pivoting into construction, ERA gave me the practical foundation I needed. The site supervision module and concrete works training were exactly what employers were looking for.",
    "cohort": "Cohort 6"
  },
  {
    "id": 6,
    "name": "Fatima Bello",
    "role": "Quantity Surveyor at Dutum Construction",
    "avatar": "/placeholder.svg",
    "quote": "ERA's programme is intense but worth every naira. The quantity surveying and estimation skills I gained here are what I use every single day at work. The alumni network has also been invaluable for career growth.",
    "cohort": "Cohort 4"
  }
]
